---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarConstraint.TargetIsBarBend
source: html/dea5e5f2-781d-d274-1e4f-fd762cdb48df.htm
---
# Autodesk.Revit.DB.Structure.RebarConstraint.TargetIsBarBend Method

Returns true if the RebarTargetConstraintType of the RebarConstraint is 'BarBend'.

## Syntax (C#)
```csharp
public bool TargetIsBarBend()
```